irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_bkp_771_IUT.c
  uint16_t tmpreg = 0;

  ((void)0);
  tmpreg = ((BKP_TypeDef *) (((uint32_t)0x40000000) + 0x6C00))->RTCCR;

  tmpreg &= ((uint16_t)0xFC7F);


  tmpreg |= BKP_RTCOutputSource;

  ((BKP_TypeDef *) (((uint32_t)0x40000000) + 0x6C00))->RTCCR = tmpreg;

CS_CMM_PROBE_NODE_STMT(21,6,1) 
 CODESCROLL_FUNC_END(45, 3, 196) } CODESCROLL_FUNC_END_RBRACE 







void BKP_SetRTCCalibrationValue(uint8_t CalibrationValue)
{ CODESCROLL_FUNC_BEGIN(46, (46, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable116,95) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable117,21,5,0)

  uint16_t tmpreg = 0;

  ((void)0);
  tmpreg = ((BKP_TypeDef *) (((uint32_t)0x40000000) + 0x6C00))->RTCCR;

  tmpreg &= ((uint16_t)0xFF80);

  tmpreg |= CalibrationValue;

  ((BKP_TypeDef *) (((uint32_t)0x40000000) + 0x6C00))->RTCCR = tmpreg;

CS_CMM_PROBE_NODE_STMT(21,4,1) 
 CODESCROLL_FUNC_END(46, 3, 216) } CODESCROLL_FUNC_END_RBRACE 
/* # 225 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_bkp.c"*/
void BKP_WriteBackupRegister(uint16_t BKP_DR, uint16_t Data)
{ CODESCROLL_FUNC_BEGIN(47, (47, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable118,96) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable119,21,3,0)

  volatile uint32_t tmp = 0;


  ((void)0);

  tmp = (uint32_t)(((uint32_t)0x40000000) + 0x6C00);
  tmp += BKP_DR;

  *(volatile uint32_t *) tmp = Data;

CS_CMM_PROBE_NODE_STMT(21,2,1) 
 CODESCROLL_FUNC_END(47, 3, 236) } CODESCROLL_FUNC_END_RBRACE 







uint16_t BKP_ReadBackupRegister(uint16_t BKP_DR)
{ CODESCROLL_FUNC_BEGIN(48, (48, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable120,97) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable121,21,1,0)

  volatile uint32_t tmp = 0;


  ((void)0);

  tmp = (uint32_t)(((uint32_t)0x40000000) + 0x6C00);
  tmp += BKP_DR;

  
  CS_CMM_PROBE_NODE_STMT(21,0,1) 
   CODESCROLL_FUNC_END(48, 3, 254) return (*(volatile uint16_t *) tmp);
} CODESCROLL_FUNC_END_RBRACE 






FlagStatus BKP_GetFlagStatus(void)
{ CODESCROLL_FUNC_BEGIN(49, (49, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable122,98) 
  
  CS_CMM_PROBE_NODE_STMT(22,7,0) 
  CS_CMM_PROBE_NODE_STMT(22,6,1) 
   CODESCROLL_FUNC_END(49, 3, 264) return (FlagStatus)(*(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x6C00) - ((uint32_t)0x40000000)) + 0x34) * 32) + (0x08 * 4)));
} CODESCROLL_FUNC_END_RBRACE 






void BKP_ClearFlag(void)
{ CODESCROLL_FUNC_BEGIN(50, (50, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable123,99) 

  
  CS_CMM_PROBE_NODE_STMT(22,5,0) ((BKP_TypeDef *) (((uint32_t)0x40000000) + 0x6C00))->CSR |= ((uint16_t)0x0001);

CS_CMM_PROBE_NODE_STMT(22,4,1) 
 CODESCROLL_FUNC_END(50, 3, 276) } CODESCROLL_FUNC_END_RBRACE 






ITStatus BKP_GetITStatus(void)
{ CODESCROLL_FUNC_BEGIN(51, (51, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable124,100) 
  
  CS_CMM_PROBE_NODE_STMT(22,3,0) 
  CS_CMM_PROBE_NODE_STMT(22,2,1) 
   CODESCROLL_FUNC_END(51, 3, 285) return (ITStatus)(*(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x6C00) - ((uint32_t)0x40000000)) + 0x34) * 32) + (0x09 * 4)));
} CODESCROLL_FUNC_END_RBRACE 






void BKP_ClearITPendingBit(void)
{ CODESCROLL_FUNC_BEGIN(52, (52, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable125,101) 

  
  CS_CMM_PROBE_NODE_STMT(22,1,0) ((BKP_TypeDef *) (((uint32_t)0x40000000) + 0x6C00))->CSR |= ((uint16_t)0x0002);

CS_CMM_PROBE_NODE_STMT(22,0,1) 
 CODESCROLL_FUNC_END(52, 3, 297) } CODESCROLL_FUNC_END_RBRACE 
